In [1]:
import sqlite3

In [15]:
con = sqlite3.connect('patients.db')
con

In [16]:
con.execute('CREATE TABLE patients(id Integer Primary Key, name Varchar)')

In [18]:
con.execute("INSERT INTO patients(id, name) VALUES (?, ?)", (1, "Nick"))

In [20]:
con.executemany("INSERT INTO patients(id, name) VALUES (?, ?)", [(2, "Emma"), (3, "Adrian")])

In [21]:
con.commit()

In [26]:
con.execute("SELECT * FROM patients").fetchall()

[(1, 'Nick'), (2, 'Emma'), (3, 'Adrian')]

In [34]:
con.execute('.headers ON;')

OperationalError: near ".": syntax error

In [37]:
import pandas as pd

In [39]:
names = [row[1] for row in con.execute("PRAGMA table_info(patients);").fetchall()]
data = con.execute("SELECT * FROM patients").fetchall()
pd.DataFrame(data=data, columns=names)

   id    name
0   1    Nick
1   2    Emma
2   3  Adrian

In [30]:
import pandas as pd
import sqlalchemy

In [32]:
pd.read_sql_table('patients', con=sqlalchemy.create_engine("sqlite:///patients.db").connect())

   id    name
0   1    Nick
1   2    Emma
2   3  Adrian